#დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს "n" და ბეჭდავს 1-დან "n"-მდე რიცხვების ჯამს.
n = int(input("შეიყვანეთ რიცხვი n: "))

ჯამი = 0
for i in range (1, n+1):
    ჯამი += i
print(f"1-დან {n}-მდე რიცხვების ჯამია: {ჯამი}")

#დაწერეთ პითონის პროგრამა, რონმელიც მიიღებს მომხმარებლისგან რიცხვს და შემდეგ იყენებს while ციკლს რომ რევერსულად დაბეჭდოს რიცხვები 0-მდე
n = int(input("შეიყვანეთ რიცხვი: "))

while n >= 0 :
    print(n)
    n -= 1

#დაწერეთ პითონის პროგრამა თამაშისთვის, რომელიც მუდმივად სთხოვს მომხმარებელს გამოიცნოს წინასწარ განსაზღვრული რიცხვი. როდესაც მომხმარებელი გამოიცნობს სწორ რიცხვს, დაასრულებს პროგრამა მუშაობას.
სწორი_რიცხვი = 43

while True:
    მცდელობა = int(input("გამოიცანი რიცხვი: "))

    if მცდელობა == სწორი_რიცხვი:
        print ("გილოცავ, სწორად გამოიცანი!")
        break
    elif მცდელობა < სწორი_რიცხვი:
        print("მეტი")
    else:
        print("ნაკლები")

# დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, შეამოწმეთ რიცხვი თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს. ეს პროცესი გაგრძელდეს იქამდე, სანამ მომხმარებელი არ შეიყვანს "sum" ტექსტს, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი
total_sum = 0

while True:
    შეყვანა = input("შეიყვანეთ რიცხვი (ან 'sum' ჯამის სანახავად):" )

    if შეყვანა == "sum":
        print(f"დადებითი რიცხვების ჯამია: {total_sum}")
        break

    რიცხვი = int(შეყვანა)

    if რიცხვი > 0:
        total_sum += რიცხვი
        print(f"{რიცხვი} დაემატა!")

    else:
        print(f"{რიცხვი} უარყოფითია და არ დაემატა!")