# კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).
a = int(input("შეიყვანეთ პირველი რიცხვი: "))
b = int(input("შეიყვანეთ მეორე რიცხვი: "))

print(f"მიმატება: {a} + {b} = {a + b}")
print(f"გამოკლება: {a} - {b} = {a - b}")
print(f"გამრავლება: {a} * {b} = {a * b}")
print(f"ჩვეულებრივი გაყოფა: {a} / {b} = {a // b}")
print(f"მთელზე გაყოფა: {a} // {b}= {a // b}")
print(f"ნაშთის აღება: {a} % {b} = {a % b}")
print(f"ახარისხება: {a} ** {b} = {a ** b}")


#დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.
d1 = float(input("შეიყვანეთ პირველი დიაგონალის სიგრძე: "))
d2 = float(input("შეიყვანეთ მეორე დიაგონალის სიგრძე: "))

ფართობი = (d1 * d2) / 2
print(f"რომბის ფართობია: {ფართობი}")

# მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.
d1 = float(input("შეიყვანეთ მეტრი: "))
სმ = d1 * 100
დმ = d1 * 10
მმ = d1 * 1000
მილი = d1 * 0.000621

print(f"თქვენი მონაცემი სანტიმეტრებში არის: {სმ}")
print(f"თქვენი მონაცემი დეციმეტრებში არის: {დმ}")
print(f"თქვენი მონაცემი მილიმეტრებში არის: {მმ}")
print(f"თქვენი მონაცემი მილებში არის: {მილი}")


#დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.
ფუძე = float(input("შეიყვანეთ სამკუთხედის ფუძე: "))
სიმაღლე = float(input("შეიყვანეთ სამკუთხედის სიმაღლე: "))
 
ფართობი = (ფუძე * სიმაღლე) / 2

print(f"სამკუთხედის ფართობია: {ფართობი}")


#კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.

რიცხვი = int(input("შეიყვანეთ ორნიშნა რიცხვი: "))

პირველი_ციფრი = რიცხვი // 10
მეორე_ციფრი = რიცხვი % 10

ჯამი = პირველი_ციფრი + მეორე_ციფრი
print(f"ციფრთა ჯამია: {ჯამი}")
